export type Question = {
  id: number;
  text: string;
  options: string[];
};

// 7つの質問を定義
export const questions: Question[] = [
  {
    id: 1,
    text: "会食のプランは？",
    options: [
	  "ゲストに喜ばれる接待・食事会",
      "食べ放題プランのあるお店",
      "2次会にオススメのお店",
      "10人以上でもOKの個室",
      "3000～4000円台のご褒美コース",
	  "5000～8000円の贅沢コース",
      "こだわりのビールが飲めるお店",
      "内装がオシャレなお店",
	  "誕生日・記念日サービスあり",
    ],
  },
  {
    id: 2,
    text: "何料理が良いんだ？",
    options: [
      "居酒屋",
      "創作料理",
      "和食",
	  "洋食",
      "中華",
      "イタリアン",
      "フレンチ",
      "お好み焼き・もんじゃ",
      "その他",
    ],
  },
  {
    id: 3,
    text: "予算はいくらだ？",
    options: [
      "1501～2000円",
      "2001～3000円",
      "3001～4000円",
	  "4001～5000円",
	  "5001～7000円",
      "7001～10000円",
    ],
  },
  {
    id: 4,
    text: "会食の規模は？",
    options: ["5名以下", "6～15名", "16名以上"],
  },
  {
    id: 5,
    text: "希望の席種はあるか？",
    options: ["個室", "お座敷", "貸切", "特になし"],
  },
  {
    id: 6,
    text: "その他に希望はあるか？",
    options: ["なし", "その他"],
  },
];